Revit 2026 API

# FamilyManagerSet(FamilyParameter, String) Method

---

Set the string value of a family parameter of the current family type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Set(
	FamilyParameter familyParameter,
	string value
)
```
```vb
Public Sub Set (
	familyParameter As FamilyParameter,
	value As String
)
```
```cpp
public:
void Set(
	FamilyParameter^ familyParameter,
	String^ value
)
```
```fsharp
member Set :
        familyParameter : FamilyParameter *
        value : string -> unit
```

#### Parameters

familyParameter FamilyParameter
    A family parameter of the current type.
value String
    The new value for family parameter.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the input argument-"familyParameter"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid family parameter. |
| ArgumentOutOfRangeException | Thrown when the input argument-"familyParameter"-is out of range. |
| InvalidOperationException | Thrown when the family parameter is determined by formula, or the current family type is invalid. |

#### Reference

FamilyManager Class

Set Overload

Autodesk.Revit.DB Namespace